app/views/questions/show.html.erb

<h3 class="comments_title">
  <%= @question.comments.count %> Comments
---
SELECT "comments".* FROM "comments" WHERE "comments"."question_id" = $1  [["question_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."question_id" = $1  [["question_id", 1]]