app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "created_at", "updated_at", "student_id", "question_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "slnlsdndlndnlssd"], ["created_at", "2017-08-09 03:02:44.122687"], ["updated_at", "2017-08-09 03:02:44.122687"], ["student_id", 4], ["question_id", 1]]
INSERT INTO "questions" ("body", "created_at", "updated_at", "student_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "lasldnlsdnd"], ["created_at", "2017-08-09 02:45:05.153582"], ["updated_at", "2017-08-09 02:45:05.153582"], ["student_id", 4]]
---
  def create
   # @question = question.find(params[:question_id])
    @comment = @question.comments.new(comment_params)
    @comment.student_id = current_student.id if current_student


    # @comment.student_id= current_student.id
    # @comment.question_id= @question.id


    respond_to do |format|
      if @comment.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_question
  @question = Question.find(params[:question_id])