app/controllers/questions_controller.rb

  def index
    @questions = Question.all
---
SELECT "questions".* FROM "questions" ORDER BY created_at DESC

  def create
    @question = current_student.questions.build(question_params)
    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("tile", "body", "created_at", "updated_at", "student_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["tile", "test post"], ["body", "hiii hellooo"], ["created_at", "2017-08-07 16:30:56.699090"], ["updated_at", "2017-08-07 16:30:56.699090"], ["student_id", 1]]

  def update
    respond_to do |format|
      if @question.update(question_params)
---
UPDATE "questions" SET "tile" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["tile", "Wooww post"], ["updated_at", "2017-08-10 17:34:21.461431"], ["id", 1]]

    def upvote
    @question=Question.find(params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def downvote
    @question=Question.find(params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]